{"id":1255,"date":"2010-06-22T13:54:21","date_gmt":"2010-06-22T12:54:21","guid":{"rendered":"http:\/\/www.ordisoftware.com\/"},"modified":"2020-12-23T04:07:02","modified_gmt":"2020-12-23T03:07:02","slug":"gsc","status":"publish","type":"page","link":"https:\/\/www.ordisoftware.com\/about\/gsc\/","title":{"rendered":"Conditions générales de vente"},"content":{"rendered":"<p style=\"margin-bottom:25px;\"><p><\/p>\n<h3>Création de sites web et de programmes<\/h3>\n<p><span style=\"color: #00152b;\"><em>Version 1.5 du 15 avril 2011<\/em><\/span><\/p>\n<h4>Article 0. Définitions<\/h4>\n<p><em>Projet<\/em> : Site internet ou programme informatique à créer.<br \/>\n<em>Logiciel<\/em> : Ensemble des fichiers permettant la mise en production du projet.<br \/>\n<em>Service<\/em> : Ensemble des moyens utilisés pour la réalisation du projet.<br \/>\n<em>Client<\/em> : Personne requérant le service, responsable de l’ouvrage.<br \/>\n<em>Prestataire<\/em> : Personne chargée du service, responsable de l’œuvre.<br \/>\n<em>Devis<\/em> : Document décrivant les services et les tarifs.<br \/>\n<em>Informations projet :<\/em> Document décrivant le projet en tant qu’étude préalable.<\/p>\n<h4>Article 1. Objet du contrat<\/h4>\n<p>1.1. Le prestataire s'engage à fournir au client les services décrits dans le devis et les informations projet aux prix indiqués par le devis et aux conditions définis ci-après.<\/p>\n<h4>Article 2. Services fournis<\/h4>\n<p>2.1. Les services faisant l'objet du présent accord peuvent consister en l’étude, l'analyse, la conception, l'écriture, la mise au point, le déploiement, l’installation et la configuration d'un logiciel.<\/p>\n<p>2.2. Les services sont décrits dans le devis, et les spécifications du logiciel à construire figurent dans les informations projet ou dans le cahier des charges.<\/p>\n<p>2.3. Toute modification requise par le client ou non prévue dans le présent contrat entraînant des services complémentaires sera facturée en sus aux tarifs en vigueur.<\/p>\n<p>2.4. Une description générale des services et des tarifs sont disponibles sur le site du prestataire.<\/p>\n<h4>Article 3. Délais de réalisation<\/h4>\n<p>3.1. Le prestataire s'engage, dans les conditions et limites du présent contrat, à effectuer les travaux définis par le devis dans le délai indiqué par celui-ci, à compter de la remise par le client de la totalité des éléments d'information nécessaires à l'analyse, à la conception et à l’élaboration du logiciel.<\/p>\n<p>3.2. Le prestataire ne pourra pas être tenue pour responsable d'un retard ayant pour origine des causes échappant à son contrôle, ou dans les cas où les informations devant être fournies par le client seraient remises en retard, seraient incomplètes ou non conformes.<\/p>\n<h4>Article 4. Informations et jeux d'essais<\/h4>\n<p>4.1. Dans le cas où le service n’inclut pas l’établissement des données suivantes, le client s'engage à les fournir au prestataire en même temps que la commande : cahier des charges et spécifications complètes de l'application prévue, type d'équipement sur lequel le logiciel sera utilisé, documentation complète sous la forme de fiches types, modèles de documents, schémas, paramètres, etc.<\/p>\n<p>4.2. Si les données remises par le client s'avéraient incomplètes, erronés ou non conformes, les travaux supplémentaires d'analyse et le dépassement de délai seraient à la charge du client.<\/p>\n<p>4.3. Le client devra fournir des jeux d'essais permettant de s'assurer que le logiciel mis en œuvre par le prestataire convient aux besoins du client.<\/p>\n<p>4.4. Les jeux d'essais seront établis sous la responsabilité du client, même si le prestataire est amené à participer à leur mise au point. Ils devront être remis par le client dans les délais indiqués par le devis ou les informations projet.<\/p>\n<h4>Article 5. Réception du logiciel<\/h4>\n<p>5.1. Sauf indication contraire, le logiciel sera remis au client sur un support numérique CD ou DVD incluant tous les fichiers réalisés au cours de la prestation du service : documentation, code source et programme exécutable.<\/p>\n<p>5.2. Le logiciel sera considéré comme conforme après mise en place sur le système du client selon les modalités définies dans le devis ou les informations projet (ordinateur, hébergeur, installer, etc.) et contrôle de la validité à la suite d'un traitement effectué sur les jeux d'essais. Le prestataire communiquera les résultats des essais au client qui devra s'assurer qu'ils sont conformes aux besoins.<\/p>\n<p>5.3. Si les jeux d'essais n'ont pas été remis dans les conditions prévues, ou si le client n'a pas fait de réclamation écrite dans les dix jours ouvrés qui suivent l'envoi des résultats, les programmes fournis seront considérés comme satisfaisants et acceptés en l'état par le client.<\/p>\n<p>5.4. La réception des résultats, sans réclamation ou contestation, vaudra recette définitive et la responsabilité ultérieure du prestataire se trouvera dégagée en l'absence de réserves justifiées et formulées par le client.<\/p>\n<h4>Article 6. Propriété intellectuelle<\/h4>\n<p>6.1. Toutes les instructions, programmes, documentations et fichiers mis au point par le prestataire pour le développement du logiciel restent la propriété du prestataire qui se réserve la qualité d'auteur, à moins qu'il n'en soit spécifié autrement dans le devis ou les informations projet. Le prestataire pourra utiliser l'ensemble des informations et enseignements issus de la mise au point des programmes, à l'exception des données confidentielles concernant le client et son activité.<\/p>\n<p>6.2. Soit le logiciel est développé selon les termes d’une licence indiquée dans le devis ou les informations projet ; soit le client aura la liberté d’utilisation du logiciel qui lui est destiné sans pouvoir le vendre, le céder, le concéder ou le divulguer à des tiers sans l'accord du prestataire.<\/p>\n<p>6.3. Le client pourra faire évoluer le logiciel, par lui-même ou en faisant appel aux services d'un autre prestataire, selon les limites des clauses de cet article.<\/p>\n<h4>Article 7. Éléments textuels, graphiques et multimédias<\/h4>\n<p>7.1. Soit le prestataire fournira tous les éléments graphiques et textuels à intégrer dans le produit et fera son affaire des droits de propriété intellectuelle, en sorte que le client ne puisse en aucun cas être inquiété au titre d'une reproduction et d’un usage illicite de ces éléments,<\/p>\n<p>7.2. Soit le client fournira tous les éléments graphiques et textuels à intégrer dans le produit et signalera au prestataire tous ceux de ces éléments qui ne sont pas dans le domaine public, en sorte que le prestataire soit constamment en mesure d'envisager la nécessité de l'acquisition des droits de reproduction.<\/p>\n<h4>Article 8. Confidentialité<\/h4>\n<p>8.1. Le prestataire s'interdit de divulguer les informations qui lui auront été communiquées par le client et stipulées expressément confidentielles.<\/p>\n<p>8.2. Le client s'interdit de divulguer les programmes, données, méthodes et renseignements dont il aura eu connaissance au cours du présent contrat, à moins que le devis ou les informations projet n’en spécifie autrement.<\/p>\n<p>8.3. À moins qu’il n’en soit stipulé autrement dans le devis, le client et le prestataire s’autorisent à utiliser leurs noms, coordonnées et images commerciales pour un usage strictement marketing et référentiel. Tout autre usage de ces éléments sans accord préalable est interdit.<\/p>\n<h4>Article 9. Responsabilités et garanties<\/h4>\n<p>9.1. La responsabilité du prestataire concernant les services sera entièrement dégagée à compter de la réception du logiciel terminé. Les modifications et le traitement de nouvelles données feront l’objet d’un nouveau service.<\/p>\n<p>9.2. Le code logiciel est garanti contre tout défaut de fabrication technique et contre les opérations bloquantes durant un an à compter de la date de livraison, c'est-à-dire la date figurant sur la facture. L’intervention d’un tiers sur le logiciel, le code source et la base de données, annule cette garantie.<\/p>\n<p>9.3. Si le présent contrat ne pouvait pas être réalisé en tout ou en partie, du fait de causes indépendantes de la volonté du prestataire, sa responsabilité ne pourrait pas être engagée. Dans tous les cas, la responsabilité éventuelle du prestataire ne pourra pas entraîner d'indemnités supérieures aux sommes versées par le client pour les services prévus au présent contrat.<\/p>\n<p>9.4. Le client est seul responsable de l’usage qu’il effectue du logiciel. Le prestataire ne pourra en aucun cas être tenu pour responsable des services et des produits du client, ni de la mauvaise utilisation technique, sociale ou juridique des programmes.<\/p>\n<p>9.5. Le client s’engage à pouvoir démontrer au prestataire qu’il possède un droit d’exploitation de ses services et de ses produits, et que son activité est légale et déclarée. Si le client ne peut pas justifier de son droit, quelle que soit l’avancée du projet, le présent contrat sera annulé sans restitution des sommes versés et sans indemnisation.<\/p>\n<p>9.6. Toute réclamation juridique doit être effectuée auprès des institutions françaises.<\/p>\n<h4>Article 10. Prix et modalités de paiement<\/h4>\n<p>10.1. Le prix des services prévus au présent contrat figurent sur le devis. Ils ne comprennent pas les frais de déplacement et d’hébergement. Ils pourront être révisés conformément aux conditions générales de vente.<\/p>\n<p>10.2. Le prix convenu fera l'objet d'une facturation et d'un paiement selon les modalités indiquées par le devis.<\/p>\n<p>10.3. Les sommes dues par le client seront intégralement payables à leur échéance. Toute pénalité de retard sera calculée selon une majoration de 5% des sommes dues.<\/p>\n<p>10.4. Les prix ne comprennent pas les coûts de licences logicielles, ou les donations auprès des concepteurs de logiciels libres et open source dont les montants sont à l'appréciation du client.<\/p>\n<\/p>","protected":false},"excerpt":{"rendered":"<p>Conditions générales de vente - Création de sites web et de programmes. <\/p>\n<p><span style=\"color:#333\"> &rarr; <a href=\"https:\/\/www.ordisoftware.com\/about\/gsc\/\">Lire la suite<\/a><\/span><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":2,"menu_order":23,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/1255"}],"collection":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/comments?post=1255"}],"version-history":[{"count":0,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/1255\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/media?parent=1255"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}