{"id":1255,"date":"2010-06-22T13:54:21","date_gmt":"2010-06-22T12:54:21","guid":{"rendered":"http:\/\/www.ordisoftware.com\/"},"modified":"2020-12-23T04:07:02","modified_gmt":"2020-12-23T03:07:02","slug":"gsc","status":"publish","type":"page","link":"https:\/\/www.ordisoftware.com\/en\/about\/gsc\/","title":{"rendered":"General sales conditions"},"content":{"rendered":"<p style=\"margin-bottom:25px;\"><p><\/p>\n<h3>Websites and programs creation<\/h3>\n<p><span style=\"color: #00152b;\"><em>Version 1.5 of April 15, 2011<\/em><\/span><\/p>\n<h4>Article 0.         Definitions<\/h4>\n<p><em>Project<\/em>: Website or computer program to create.<br \/>\n<em>Software<\/em>: All files to get a project into production.<br \/>\n<em>Service<\/em>: All means used to realize the project.<br \/>\n<em>Customer<\/em>: Person requesting the service, project owner.<br \/>\n<em>Provider<\/em>: Person in charge of the service, project manager.<br \/>\n<em>Estimate<\/em>: Document describing services and rates.<br \/>\n<em>Project information<\/em>: Document describing the project as a preliminary study.<\/p>\n<h4>Article 1.         Subject of the contract<\/h4>\n<p>1.1.     The provider agrees to supply the customer with the services described in the estimate and project information at the prices indicated by the specifications and at the conditions indicated below.<\/p>\n<h4>Article 2.         Services covered<\/h4>\n<p>2.1.     The services covered by this agreement may consist in the study, analysis, design, writing, development, deployment, installation and configuration of a software.<\/p>\n<p>2.2.     The services are described in the estimate, and the specifications of the software to build are contained in the project information or in the project requirements.<\/p>\n<p>2.3.     Any modifications required by the customer or not expected in this contract resulting in additional services will be charged at applicable rates.<\/p>\n<p>2.4.     A general description of services and rates are available on the provider’s website.<\/p>\n<h4>Article 3.         Lead time<\/h4>\n<p>3.1.     The provider agrees, under the conditions and limitations of this contract, to perform the work defined by the specifications within the time specified by it, after the delivery by the customer of all of the information needed to the analysis, design and development of the software.<\/p>\n<p>3.2.     The provider cannot be held liable for delays that originate from causes outside of his control, or in cases where the information to be supplied by the customer would be submitted late, incomplete or non-compliant.<\/p>\n<h4>Article 4.         Information and test cases<\/h4>\n<p>4.1.     In the case the service does not include the establishment of the following data, the customer agrees to supply them to the provider along with the command: requirements and full specifications of the intended application, type of equipment on which the software will be used, complete documentation in the form of sheets, files, documents templates, diagrams, settings, etc..<\/p>\n<p>4.2.     If the data submitted by the customer proved to be incomplete, incorrect or non-compliant, the additional work of analysis and the time exceeded would be charged to the customer.<\/p>\n<p>4.3.     The customer will supply test cases to ensure that the software implemented by the provider is suited to customer needs.<\/p>\n<p>4.4.     The test cases will be prepared under the responsibility of the customer, even if the provider is required to participate in their development. The customer must submit them within the time specified by the estimate or the project information.<\/p>\n<h4>Article 5.         Receiving the software<\/h4>\n<p>5.1.     Unless otherwise specified, the software will be delivered to the customer on a digital CD or DVD including all the files made during the service: documentation, source code and executable program.<\/p>\n<p>5.2.     The software will be considered compliant after the installation on the customer system as defined in the estimate or information project (computer, hosting, install, etc.) and the checking of the validity following a process conducted on test cases. The provider will communicate test results to the customer who must ensure they meet requirements.<\/p>\n<p>5.3.     If the test cases have not been delivered as required, or if the customer has not made a written complaint within ten workdays after the sending of the results, the programs supplied will be considered satisfactory and accepted as such by the customer.<\/p>\n<p>5.4.     The receiving of the results, without complaint or contestation, will be the final acceptance and the further responsibility of the provider is disengaged in the absence of reservations made and justified by the customer.<\/p>\n<p><strong> <\/strong><\/p>\n<h4>Article 6.         Intellectual property<\/h4>\n<p>6.1.     All instructions, programs, documentations and files developed by the provider for the development of the software remain the property of the provider who reserves the authorship, unless otherwise specified in the estimate or the project information. The provider can use all information and lessons from development programs, except confidential data concerning the customer and its business.<\/p>\n<p>6.2.     Either the software is developed under the terms of a license specified in the estimate or the information project; either the customer will have the freedom of use of the software intended for him without being able to sell, transfer, grant, or disclose it to third parties without the permission of the provider.<\/p>\n<p>6.3.     The customer may improve the software, by itself or by using the services of another provider, under the limits of the terms of this article.<\/p>\n<h4>Article 7.         Text, graphical and multimedia items<\/h4>\n<p>7.1.     Either the provider supplies all textual and graphical items to be included in the product and shall obtain all related intellectual property rights, so that the customer can never be sued by any copying and illegal use of these elements,<\/p>\n<p>7.2.     Either the customer supplies all textual and graphical items to be included in the product and will report to the provider all of the elements that are not in the public domain, so that the provider is able to consistently consider the need for the acquisition of reproduction rights.<\/p>\n<h4>Article 8.         Privacy<\/h4>\n<p>8.1.     The provider agrees not to disclose information that have been supplied by the customer and stated explicitly confidential.<\/p>\n<p>8.2.     The customer agrees not to disclose programs, data, methods and information that he has been aware in the current contract, unless otherwise specified in the estimate or the project information.<\/p>\n<p>8.3.     Unless otherwise stated in the estimate, the customer and the provider allow themselves to use their names, coordinates and business image solely for marketing and reference. Any other use of these elements without prior consent is prohibited.<\/p>\n<h4>Article 9. Liabilities and warranties<\/h4>\n<p>9.1. The provider's liability for services will be completely cleared at the receipt of completed software. Changes and processing of new data will be a new service.<\/p>\n<p>9.2. The software code is guaranteed against defects in technical workmanship and against blocking operations for one year from the date of delivery, that is the date on the invoice. The intervention of a third party on the software, source code and database, voids this warranty.<\/p>\n<p>9.3. If this contract could not be realized in whole or in part, due to causes beyond the control of the provider, his responsibility could not be committed. In all cases, the potential responsibility of the provider will not result in benefits greater than the amounts paid by the customer for services under this contract.<\/p>\n<p>9.4. The customer is solely responsible for the use he makes of the   software. The provider will not be held responsible for the customer   services and products, or for his technical, social or legal misuse of   the programs.<\/p>\n<p>9.5. The customer undertakes to demonstrate to the provider that he has the right to use its services and products, and that its activity is legal and reported. If the customer cannot prove his right, whatever the progress of the project, this contract will be canceled without refund of money paid and without compensation.<\/p>\n<p>9.6. Any legal claim must be made to French institutions.<\/p>\n<h4>Article 10.      Prices and payment terms<\/h4>\n<p>10.1. Prices for services of this contract are indicated in the estimate. They do not include travel and accommodation. They may be revised in accordance with the general sales conditions.<\/p>\n<p>10.2. The price agreed will be invoiced and paid as indicated by the estimate.<\/p>\n<p>10.3. The amounts owed by the customer shall be fully payable at the due date. Any delay penalty will be calculated using a 5% increase in the amounts due.<\/p>\n<p>10.4. Prices do not include costs for software licenses, or donations to developers of libre and open source software whose amounts are at the discretion of the customer.<\/p>\n<\/p>","protected":false},"excerpt":{"rendered":"<p>General sales conditions - Websites and programs creation. <\/p>\n<p><span style=\"color:#333\"> &rarr; <a href=\"https:\/\/www.ordisoftware.com\/en\/about\/gsc\/\">Read next<\/a><\/span><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":2,"menu_order":23,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/pages\/1255"}],"collection":[{"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/comments?post=1255"}],"version-history":[{"count":0,"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/pages\/1255\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.ordisoftware.com\/en\/wp-json\/wp\/v2\/media?parent=1255"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}