{"id":2617,"date":"2008-11-21T12:00:00","date_gmt":"2008-11-21T11:00:00","guid":{"rendered":"http:\/\/www.ordisoftware.com\/?page_id=2617"},"modified":"2020-12-23T04:08:24","modified_gmt":"2020-12-23T03:08:24","slug":"libre-software","status":"publish","type":"page","link":"https:\/\/www.ordisoftware.com\/about\/libre-software\/","title":{"rendered":"A propos des logiciels libres"},"content":{"rendered":"<p style=\"margin-bottom:25px;\"><p><\/p>\n<p style=\"margin-top: 25px;\">Il existe deux catégories de logiciels : ceux qui sont propriétaires et que nous devons habituellement payer pour leur utilisation, et ceux qui sont libres et que nous n'avons pas l'obligation d'acheter.<\/p>\n<p>Logiciels commerciaux et logiciels libres ne sont pas forcément opposables, et les objectifs n'ont parfois pas de rapport avec leurs différences qui peuvent se mélanger selon le domaine, le besoin, le type et l'envergure d'un projet.<\/p>\n<p>Dans les deux cas, des développeurs fournissent un travail immatériel, grâce à un support matériel, pour lequel ils sont intellectuellement les auteurs, et qui demande du temps et de l'investissement. Le but d'un travail étant de vivre et de survivre, pour soi et pour les autres, un logiciel libre n'est donc pas synonyme de gratuité, à moins qu'il ne soit un service public financé par l'impôt.<\/p>\n<p>Les donations sont ainsi une source de revenu pour les concepteurs de logiciels libres. Tout comme nous sommes libres d'utiliser ces programmes, nous sommes aussi libres de définir ce que nous donnons selon nos moyens. Il arrive parfois que les auteurs ne sollicitent pas d'argent pour diverses raisons.<\/p>\n<p>Mais le système de donation shareware, hors du cadre de l'amateurisme concernant quelques unités de devise, excepté pour une oeuvre humanitaire non gérée par l'État, est une fausse solution problématique et litigieuse à un faux problème de trésorerie, et d'un point de vue fiscal il serait plus juste de considérer l'achat libre en tant que vente commerciale lorsque le produit est un livrable immatériel, ce qui nécessite de ne pas imposer forfaitairement l'existence d'une entité et seulement le flux d'argent engendré.<\/p>\n<p>Développer des logiciels libres est une vision relative au code source, au partage du savoir-faire et à l'évolution de l'informatique. Une définition du logiciel libre peut être trouvée sur le site de la <a href=\"http:\/\/www.fsf.org\/licensing\/essays\/free-sw.html\" target=\"_blank\" rel=\"noopener noreferrer\">Free Software Foundation<\/a>. D'autres points de vue sont également décrit par l'<a href=\"http:\/\/www.opensource.org\/docs\/osd\" target=\"_blank\" rel=\"noopener noreferrer\">Open Source Initiative<\/a> et par <a href=\"http:\/\/creativecommons.org\/about\/licenses\/\" target=\"_blank\" rel=\"noopener noreferrer\">Creative Commons<\/a>.<\/p>\n<p>Je considère le droit et la nécessité au <a href=\"https:\/\/www.ordisoftware.com\/about\/libre-software\/\">code source<\/a> de tout logiciel vendu ou diffusé gratuitement, et donc ne relevant ni l'activité interne et légale d'un groupe ni de la sécurité nationale, d'être aussi libre et monétisable par son producteur que le texte d'un livre en raison du principe immuable qu'un code caché au public est comme un livre caché au public.<\/p>\n<\/p>","protected":false},"excerpt":{"rendered":"<p>A propos des logiciels libres. <\/p>\n<p><span style=\"color:#333\"> &rarr; <a href=\"https:\/\/www.ordisoftware.com\/about\/libre-software\/\">Lire la suite<\/a><\/span><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":2,"menu_order":19,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/2617"}],"collection":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/comments?post=2617"}],"version-history":[{"count":0,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/2617\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/media?parent=2617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}