{"id":4528,"date":"2016-01-29T14:36:34","date_gmt":"2016-01-29T13:36:34","guid":{"rendered":"http:\/\/www.ordisoftware.com\/?page_id=4528"},"modified":"2021-08-08T07:03:07","modified_gmt":"2021-08-08T05:03:07","slug":"author","status":"publish","type":"page","link":"https:\/\/www.ordisoftware.com\/about\/author\/","title":{"rendered":"A propos de l'auteur"},"content":{"rendered":"<p style=\"margin-bottom:25px;\"><p><\/p>\n<div style=\"margin-top: 15px;\" id=\"toc_container\" class=\"no_bullets\"><ul class=\"toc_list\"><li><a href=\"#Presentation\">Présentation<\/a><\/li><li><a href=\"#Plus_dinformations\">Plus d'informations<\/a><\/li><li><a href=\"#Overview\">Overview<\/a><\/li><li><a href=\"#More_information\">More information<\/a><\/li><\/ul><\/div>\n<h3><span id=\"Presentation\">Présentation<\/span><\/h3>\n<p>Je suis informaticien, analyste-programmeur et développeur expert C# desktop. Je suis victime d'un crime d'État, lanceur d'alerte, anti-sectes et partisan de la nationalisation du système de santé-aide-justice selon l'article 25 de la Déclaration Universelle des Droits des Humains et les articles 9-11 du Préambule de la Constitution française.<\/p>\n<p><span class=\"lt-line-clamp__raw-line\">Je suis né en 1973. Je suis sourd partiel et malentendant depuis 1984. Je suis ainsi devenu neuroatypique. J'étudie les sciences physiques et biologiques depuis 1992 et également la Torah hébraïque depuis janvier 2004. Je suis invalide physique depuis avril 2004. J'écris des logiciels et des livres depuis fin 2011 sur ce que j'apprends. La programmation est une passion tant comme métier que loisir dont on ne se lasse jamais tellement il y a de choses à découvrir, à apprendre et à réaliser. Ma principale aptitude est le code objet et la conceptualisation du data et son traitement.<br \/>\n<\/span><\/p>\n<p><span class=\"lt-line-clamp__raw-line\">J<\/span>'ai été élevé avec les langages Basic, Assembleur, C et C++. Quand j'avais dix ans, l'école a mis un ordinateur dans mes mains et on m'a fait écrire un programme sur cette machine munie d'un clavier et d'un écran. Une heure plus tard, je me suis dit que quand je serais grand, je serais programmeur. Comme quelques-uns de la première génération, j'ai lu des livres et des revues. Je les lisais et relisais jusqu'à connaitre par coeur les mots-clés du langage et savoir contrôler les éléments de la machine. J'ai saisi à la main les codes de petits jeux et de bidouilles système. Puis j'ai commencé à écrire mes propres programmes. Au début j'ai acheté quelques jeux, puis les gens des écoles m'ont montré comment copier les cassettes pour les échanger, et ensuite ils se sont mis à me donner eux-mêmes plein de copies de logiciels sur des disquettes que j'acceptais sans savoir la valeur du travail. Au collège la conseillère d'orientation m'avait dit que le mieux pour moi était de faire un IUT informatique puis une école d'Ingénieur selon mes résultats. J'étais entièrement d'accord même si je savais rien sur beaucoup de choses. Mais ça ne s'est pas très bien passé comme prévu et je n'ai pas suivi les trois quart des cours. J'ai néanmoins eu un très bon professeur d'analyse et conception des systèmes d'information. Puis mon premier chef de projet m'a appris tout ce qu'il y avait à savoir dans les grandes lignes sur mon métier et j'ai travaillé pour de grandes entreprises et pour de grandes organisations médicales et financières.<\/p>\n<p>J'ai ainsi découvert les micro-ordinateurs en décembre 1983 et j'ai acheté un Thomson TO7-70 en 1984 puis un TO9 en 1986, un Atari 520-ST en 1988, un PC-XT en 1990, ensuite j'ai assemblé un PC i486 en 1995, un PC Athlon en 2002, un PC Core-i5 en 2009 et un PC Core-i7 en 2014. Grâce à des stages et des livres j'ai appris le Basic, l'Assembleur, le C et le C++ ainsi que le Pascal et un peu de Logo et de Prolog. Puis après avoir travaillé avec Delphi pour des entreprises, je me suis spécialisé en C#. En 2004 un chiropracteur, protégé par les autorités, les ordres médicaux, les associations d'aide aux victimes et les assurances qui me nuisent en toute impunité à ce jour, m'a gravement déchiré le dos.<\/p>\n<h3><span id=\"Plus_dinformations\">Plus d'informations<\/span><\/h3>\n<ul>\n<li><a href=\"https:\/\/www.ordisoftware.com\/business\/\">Profil métier<\/a><\/li>\n<li><a href=\"https:\/\/www.ordisoftware.com\/business\/skills\/\">Compétences<\/a><\/li>\n<li><a href=\"https:\/\/www.ordisoftware.com\/business\/history\/\">Historique<\/a><\/li>\n<li><a href=\"https:\/\/www.ordisoftware.com\/projects\/\">Projets logiciels<\/a><\/li>\n<li><a href=\"https:\/\/www.ordisoftware.com\/services\/\">Offre de services<\/a><\/li>\n<li><a href=\"https:\/\/www.ordisoftware.com\/contact\/\">Contact<\/a><\/li>\n<\/ul>\n<p><\/p>\n<\/p>","protected":false},"excerpt":{"rendered":"<p>A propos de l'auteur. <\/p>\n<p><span style=\"color:#333\"> &rarr; <a href=\"https:\/\/www.ordisoftware.com\/about\/author\/\">Lire la suite<\/a><\/span><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":2,"menu_order":17,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/4528"}],"collection":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/comments?post=4528"}],"version-history":[{"count":0,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/4528\/revisions"}],"up":[{"embeddable":true,"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/pages\/2"}],"wp:attachment":[{"href":"https:\/\/www.ordisoftware.com\/wp-json\/wp\/v2\/media?parent=4528"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}